PrgState is:
ExeStack:
(Declare variable with type: int, id=v; (v=2; print(v)))
SymTable:
Out:
FileTable:

PrgState is:
ExeStack:
Declare variable with type: int, id=v
(v=2; print(v))
SymTable:
Out:
FileTable:

PrgState is:
ExeStack:
(v=2; print(v))
SymTable:
v->0
Out:
FileTable:

PrgState is:
ExeStack:
v=2
print(v)
SymTable:
v->0
Out:
FileTable:

PrgState is:
ExeStack:
print(v)
SymTable:
v->2
Out:
FileTable:

PrgState is:
ExeStack:
SymTable:
v->2
Out:
2
FileTable:

PrgState is:
ExeStack:
SymTable:
v->2
Out:
2
FileTable:

PrgState is:
ExeStack:
SymTable:
v->2
Out:
2
FileTable:

PrgState is:
ExeStack:
SymTable:
v->2
Out:
2
FileTable:

